{
    "version": "https://jsonfeed.org/version/1",
    "title": "Amber&#x27;s Journal",
    "description": "",
    "home_page_url": "https://amberja.in",
    "feed_url": "https://amberja.in/feed.json",
    "user_comment": "",
    "author": {
        "name": "Written by Amber Jain"
    },
    "items": [
        {
            "id": "https://amberja.in/dynamic-asset-allocation-and-balanced-advantage-funds-when-to-consider.html",
            "url": "https://amberja.in/dynamic-asset-allocation-and-balanced-advantage-funds-when-to-consider.html",
            "title": "Dynamic Asset Allocation (aka Balanced Advantage Funds): When to Consider",
            "summary": "<p><em><strong>Dynamic Asset Allocation funds</strong></em>, often called <em><strong>Balanced Advantage Mutual Funds</strong></em>, are hybrid schemes that adjust the mix of equity and debt based on market conditions. In volatile times, this approach can help you participate in upside while dampening downside, which makes them relevant for investors seeking growth with a smoother ride.</p>\n",
            "content_html": "<p><em><strong>Dynamic Asset Allocation funds</strong></em>, often called <em><strong>Balanced Advantage Mutual Funds</strong></em>, are hybrid schemes that adjust the mix of equity and debt based on market conditions. In volatile times, this approach can help you participate in upside while dampening downside, which makes them relevant for investors seeking growth with a smoother ride.</p>\n\n<p>I bring a practical, investor-focused approach to explaining how dynamic asset allocation can fit into a prudent Indian investor's portfolio in 2026. This blogpost presents a balanced, educational view while highlighting factors for consideration.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jebvmfg4nt\">What balanced advantage funds are</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17a\">How the dynamic model works</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17b\">Key features and benefits</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17c\">When to consider Balanced Advantage Funds</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17d\">How Balanced Advantage compares with other funds</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17e\">Choosing a Balanced Advantage Fund</a></li>\n<li><a href=\"#mcetoc_1jec08mtg17f\">Conclusion and takeaways</a></li>\n<li><a href=\"#mcetoc_1jec17q9319o\">FAQs</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1jebvmfg4nt\">What balanced advantage funds are</h2>\n<p>Balanced Advantage Funds are mutual funds that shift asset allocation dynamically between equity and debt. The core idea is not to fix a static split but to adjust exposure as market conditions change. This dynamic model aims to capture growth when equities look affordable and to protect capital by leaning more on debt when valuations are stretched.</p>\n<h2 id=\"mcetoc_1jec08mtg17a\">How the dynamic model works</h2>\n<p>The funds rely heavily on portfolio rebalancing that decades of research has shown can help moderate volatility. Some schemes use counter-cyclical or pro-cyclical signals to guide scaling up or down equity exposure. The objective is to reduce drawdowns without abandoning upside potential in a recovery cycle. The approach is described as buy-low, sell-high within a managed framework.</p>\n<p>In practice, managers may increase debt exposure when markets look expensive and raise equity exposure when prices look more compelling. This helps diversify risk across an investment cycle while aiming for a better risk-adjusted outcome than pure equity funds.</p>\n<h2 id=\"mcetoc_1jec08mtg17b\">Key features and benefits</h2>\n<ul>\n<li><strong>Portfolio diversification within a single fund</strong>: The dynamic mix across asset classes can provide broad diversification and access to multiple drivers of return.</li>\n<li><strong>Volatility management:</strong> By leaning on debt in stressed markets, these funds can potentially reduce sharp drawdowns during downturns, while still participating in recoveries.</li>\n<li><strong>Market timing handled by experts</strong>: You do not need to time the market yourself, as trained managers adjust the allocation through the fund's model-driven process.</li>\n<li><strong>Tax considerations</strong>: In some cases the fund’s equity allocation and tax treatment can differ from plain equity funds, depending on how much equity remains in the portfolio; consult the fund’s scheme information for the exact tax implications.</li>\n</ul>\n<h2 id=\"mcetoc_1jec08mtg17c\">When to consider Balanced Advantage Funds</h2>\n<ul>\n<li><strong>Market conditions</strong>: High equity valuations or rising macro risks can justify a higher debt tilt to preserve capital, with the possibility to reallocate to equities as opportunities emerge.</li>\n<li><strong>Volatile markets</strong>: If you want equity participation but with built-in risk control, these funds can offer a balanced path through cycles of volatility.</li>\n<li><strong>Moderate risk appetite with long horizon</strong>: Investors seeking growth with a smoother ride than pure equity, and who can stay invested for 3 or more years, may find BAFs suitable as part of a diversified mix.</li>\n<li><strong>Time-constrained investors</strong>: Beginners or busy investors who prefer a hands-off approach to rebalancing may appreciate the managed dynamic approach.</li>\n</ul>\n<h2 id=\"mcetoc_1jec08mtg17d\">How Balanced Advantage compares with other funds</h2>\n<ul>\n<li>Versus <strong>static balanced funds</strong>: Static funds maintain a fixed mix such as 65/35, while Balanced Advantage funds adjust dynamically. The dynamic approach can alter risk and return profiles based on valuation signals.</li>\n<li>Versus <strong>pure equity funds</strong>: BAFs aim to deliver growth potential with some downside discipline, but they may underperform in a strong bull market when downshifts to debt occur.</li>\n<li>Versus <strong>DIY approach</strong>: Some investors compare BAFs with a self-managed mix of separate equity and debt funds; research from Morningstar notes that a do-it-yourself route is possible but requires ongoing research and oversight.</li>\n</ul>\n<h2 id=\"mcetoc_1jec08mtg17e\">Choosing a Balanced Advantage Fund</h2>\n<ul>\n<li><strong>Understand the strategy of AMC, fund and fund manager/team</strong>: Look for explicit dynamic models or track records of asset shifts rather than disguised fixed allocations. Transparency about the model helps you gauge risk and alignment with your goals.</li>\n<li><strong>Review performance across cycles</strong>: Seek evidence of how the fund performed in bull and bear phases, not just in rising markets. Data points and charts from credible trackers can help compare defensiveness and growth phases.</li>\n<li><strong>Assess the team</strong>: Check the fund manager’s experience and the stability of the investment team. Managerial continuity matters for model-driven strategies.</li>\n<li><strong>Check costs and tax</strong>: Compare expense ratios and understand how the fund is classified for tax purposes, since dynamic allocation can influence tax treatment, depending on equity exposure levels.</li>\n<li><strong>Taxation rules</strong>: Equity-like taxation can apply if the fund maintains a high equity allocation; confirm the tax treatment with the scheme information.</li>\n</ul>\n<h2 id=\"mcetoc_1jec08mtg17f\">Conclusion and takeaways</h2>\n<p>Balanced Advantage Funds offer a dynamic path to growth with built-in risk management. They can be a useful addition to a diversified portfolio during volatile phases or when you prefer a hands-off, model-driven approach to asset allocation. As with any mutual fund, align your choice with your time horizon, risk tolerance, and financial goals, and consider a professional advisor for personalized fit.</p>\n<h2 id=\"mcetoc_1jec17q9319o\">FAQs</h2>\n<ul>\n<li>Q: What are Balanced Advantage Funds? A: They are dynamic asset allocation funds that adjust the mix of equity and debt based on market conditions to balance growth and risk [Nippon India MF] [Source: Nippon India MF].</li>\n<li>Q: How do Balanced Advantage Funds work? A: Fund managers use model-driven signals to shift capital between equities and fixed income, aiming to buy when valuations are favorable and reduce risk when markets look extended [Nippon India MF; Advisorkhoj] [Sources: Nippon India MF; Advisorkhoj].</li>\n<li>Q: Who should consider Balanced Advantage Funds? A: Moderate risk investors with a longer horizon who want to participate in equity upside without full market volatility typically find them suitable [Navi; Morningstar India] [Sources: Navi; Morningstar India].</li>\n<li>Q: Are these funds taxed like equity funds? A: Tax treatment can depend on the fund’s equity allocation; some periods of higher equity exposure may lead to equity-like taxation, but verify with the specific scheme and current tax rules [Nippon India MF] [Source: Nippon India MF].</li>\n<li>Q: How do Balanced Advantage Funds differ from static hybrids? A: Static hybrids keep a fixed allocation, while Balanced Advantage Funds adjust the mix; this can lead to different risk and return profiles over cycles [Times of India; Nippon India MF] [Sources: Times of India; Nippon India MF].</li>\n<li>Q: When might Balanced Advantage Funds not be ideal? A: In a strong uptrend that lasts long, or when the manager’s model underweights equities during rallies, performance may lag; these funds also come with higher costs and complexity [Times of India; Value Research] [Sources: Times of India; Value Research].<br>Anchor texts for further exploration (See also)</li>\n</ul>\n<p class=\"msg msg--warning\">Disclaimer: Mutual fund investments are subject to market risks. Read all scheme-related documents carefully before investing. Past performance is not indicative of future results. The content above is for educational and informational purposes only and should not be construed as investment advice.</p>",
            "image": "https://amberja.in/media/posts/70/Dynamic-Asset-Allocation-mf-aka-Balanced-Advantage-mutual-Fund.png",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "What&#x27;s What in Finance"
            ],
            "date_published": "2026-01-07T15:50:28+05:30",
            "date_modified": "2026-01-07T16:21:55+05:30"
        },
        {
            "id": "https://amberja.in/which-hybrid-fund-type-suits-different-risk-profiles.html",
            "url": "https://amberja.in/which-hybrid-fund-type-suits-different-risk-profiles.html",
            "title": "Which Hybrid Mutual Funds Suit Different Risk Profiles?",
            "summary": "<p><strong>Hybrid Mutual Funds</strong> blend equity and fixed income in a single portfolio, offering a way to pursue growth while aiming to dampen volatility. In 2026, these funds remain a practical part of many Indian investors’ portfolios, especially for those who want diversification without managing multiple funds. This article maps common hybrid fund types to distinct risk profiles, helping readers pick a path that aligns with their goals and time horizon.</p>\n",
            "content_html": "<p><strong>Hybrid Mutual Funds</strong> blend equity and fixed income in a single portfolio, offering a way to pursue growth while aiming to dampen volatility. In 2026, these funds remain a practical part of many Indian investors’ portfolios, especially for those who want diversification without managing multiple funds. This article maps common hybrid fund types to distinct risk profiles, helping readers pick a path that aligns with their goals and time horizon.</p>\n\n<p>In this blogpost, I bring a practical, investor-focused approach to explaining how Hybrid Mutual Funds can fit into a prudent Indian investor's portfolio in 2026. I try to present a balanced, educational view while highlighting factors for consideration.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jebti9nd4f\">Hybrid Funds &amp; Risk</a></li>\n<li><a href=\"#mcetoc_1jebti9nd4g\">Understanding Investor Risk Profiles</a>\n<ul>\n<li><a href=\"#mcetoc_1jebti9nd4h\">Conservative/Low-Risk Investors</a></li>\n<li><a href=\"#mcetoc_1jebti9nd4i\">Moderate-Risk Investors</a></li>\n<li><a href=\"#mcetoc_1jebti9nd4j\">Aggressive/High-Risk Investors</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jebti9nd4k\">Types of Hybrid Funds</a>\n<ul>\n<li><a href=\"#mcetoc_1jebu0275nb\">Conservative Hybrid Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275nc\">Balanced Hybrid Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275nd\">H3 Aggressive Hybrid Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275ne\">Dynamic Asset Allocation (Balanced Advantage) Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275nf\">Multi-Asset Allocation Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275ng\">Arbitrage Funds</a></li>\n<li><a href=\"#mcetoc_1jebu0275nh\">Equity Savings Funds (Optional category)</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jebu0275ni\">Matching Funds to Risk Profiles</a></li>\n<li><a href=\"#mcetoc_1jebu0275nj\">Other Considerations (Time Horizon, Tax, Costs)</a></li>\n<li><a href=\"#mcetoc_1jebu0275nk\">Summary / Key Takeaways</a></li>\n<li><a href=\"#mcetoc_1jebu0275nl\">Frequently Asked Questions (FAQs)</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1jebti9nd4f\">Hybrid Funds &amp; Risk</h2>\n<p class=\"mb-2 whitespace-pre-wrap\">Hybrid funds are designed to combine the potential for capital appreciation from equities with the stability of debt. The result is a spectrum of risk and return, shaped by how each fund allocates assets across stocks, bonds, and sometimes other instruments. For investors, the key question is how much risk you are willing to take and how long you plan to stay invested. By mapping risk profiles to specific hybrid fund types, you can choose a path that supports your financial objectives while keeping volatility within comfortable bounds.</p>\n<h2 id=\"mcetoc_1jebti9nd4g\">Understanding Investor Risk Profiles</h2>\n<ul>\n<li class=\"mb-2 whitespace-pre-wrap\"><strong>Conservative or low-risk investors</strong> typically prioritize capital preservation and steady income. These investors often have shorter time horizons and prefer greater exposure to fixed income.</li>\n<li class=\"mb-2 whitespace-pre-wrap\"><strong>Moderate-risk investors</strong> seek a balance between growth and stability, accepting some volatility for a more durable return profile.</li>\n<li class=\"mb-2 whitespace-pre-wrap\"><strong>Aggressive or high-risk investors</strong> pursue growth over the long term and are comfortable with higher volatility and larger equity exposure.</li>\n</ul>\n<p>So Hybrid funds can broadly be classified into 3 subcategories, based on risk profiles:</p>\n<ul>\n<li>Conservative/Low-Risk: Emphasizes capital protection with limited equity exposure and greater debt or cash components.</li>\n<li>Moderate-Risk: Aims for a blend of growth and income, usually with a balanced mix of debt and equity.</li>\n<li>Aggressive/High-Risk: Prioritizes growth, with substantial equity exposure and a smaller proportion of fixed income.</li>\n</ul>\n<h3 id=\"mcetoc_1jebti9nd4h\" class=\"mb-2 whitespace-pre-wrap\">Conservative/Low-Risk Investors</h3>\n<ul>\n<li>Typical equity exposure tends to be modest, with the majority in debt or cash equivalents.</li>\n<li>The focus is on stability and predictable income, making these funds appealing for preservation of capital.</li>\n</ul>\n<h3 id=\"mcetoc_1jebti9nd4i\" class=\"mb-2 whitespace-pre-wrap\">Moderate-Risk Investors</h3>\n<ul>\n<li>A typical balance between growth and income, with more room for market cycles than a conservative approach.</li>\n<li>Equity and debt portions are balanced to support smoother returns over time.</li>\n</ul>\n<h3 id=\"mcetoc_1jebti9nd4j\" class=\"mb-2 whitespace-pre-wrap\">Aggressive/High-Risk Investors</h3>\n<ul>\n<li>Higher equity tilt aims for stronger growth, accepting higher volatility and potential drawdowns.</li>\n<li>Time horizon is often longer to ride through market cycles.</li>\n</ul>\n<h2 id=\"mcetoc_1jebti9nd4k\">Types of Hybrid Funds</h2>\n<p class=\"mb-2 whitespace-pre-wrap\">In India, SEBI recognizes several hybrid categories that help investors align risk with asset mix. Below are definitions, asset ranges, and the risk profile they commonly serve.</p>\n<ul>\n<li>\n<h3 id=\"mcetoc_1jebu0275nb\" class=\"mb-2 whitespace-pre-wrap\">Conservative Hybrid Funds</h3>\n<ul>\n<li>Equity range roughly 10–25 percent; debt and cash the balance.</li>\n<li>Low risk, with the appeal of stability and modest upside potential.</li>\n<li>Why it matters: these funds can feel like debt with some growth potential, depending on market conditions.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275nc\" class=\"mb-2 whitespace-pre-wrap\">Balanced Hybrid Funds</h3>\n<ul>\n<li>Equity approximately 40–60 percent; debt 40–60 percent.</li>\n<li>Moderate risk with a blended growth and income profile.</li>\n<li>Why it matters: closer tracking of broader market cycles while maintaining diversification.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275nd\" class=\"mb-2 whitespace-pre-wrap\">H3 Aggressive Hybrid Funds</h3>\n<ul>\n<li>Equity about 65–80 percent; debt 20–35 percent.</li>\n<li>Higher risk, higher growth potential, and more pronounced price swings.</li>\n<li>Why it matters: suited to investors willing to endure volatility for potentially higher long-term returns.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275ne\" class=\"mb-2 whitespace-pre-wrap\">Dynamic Asset Allocation (Balanced Advantage) Funds</h3>\n<ul>\n<li>No fixed split; the manager shifts allocations between equity and debt as markets evolve.</li>\n<li>Moderate to higher risk depending on the phase of the market cycle.</li>\n<li>Why it matters: aims to dampen downturns by adjusting exposure automatically.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275nf\" class=\"mb-2 whitespace-pre-wrap\">Multi-Asset Allocation Funds</h3>\n<ul>\n<li>3+ asset classes (for example equity, debt, and commodities or gold) with a diversified mix.</li>\n<li>Generally higher equity tilt than pure debt strategies, with broader diversification.</li>\n<li>Why it matters: can smooth periods of market stress through cross-asset diversification.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275ng\" class=\"mb-2 whitespace-pre-wrap\">Arbitrage Funds</h3>\n<ul>\n<li>Focus on arbitrage opportunities within equity markets, often combining hedged equity positions with cash/debt.</li>\n<li>Usually lower risk relative to pure equity funds, with volatility targeted lower than pure equity.</li>\n<li>Why it matters: tax-efficient potential and smoother performance in varied markets.</li>\n</ul>\n</li>\n<li>\n<h3 id=\"mcetoc_1jebu0275nh\" class=\"mb-2 whitespace-pre-wrap\">Equity Savings Funds (Optional category)</h3>\n<ul>\n<li>Typically equity exposure with a substitute of hedging strategies and some debt overlay.</li>\n<li>Moderate risk with potential for steady income and reduced downside relative to pure equity.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"mcetoc_1jebu0275ni\" class=\"mb-2 whitespace-pre-wrap\">Matching Funds to Risk Profiles</h2>\n<p class=\"mb-2 whitespace-pre-wrap\">Directly mapping risk profiles to suitable hybrid fund types helps investors pick a path that aligns with their goals.</p>\n<ul>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Suitable for Low-Risk Investors</p>\n<ul>\n<li><strong>Conservative Hybrid Funds</strong> and <strong>Arbitrage Funds</strong> are commonly considered appropriate for investors prioritizing stability and capital preservation.</li>\n<li>Rationale: they offer lower equity exposure and potential for more predictable outcomes in uncertain markets.</li>\n</ul>\n</li>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Suitable for Moderate-Risk Investors</p>\n<ul>\n<li><strong>Balanced Hybrid Funds</strong> and <strong>Dynamic Asset Allocation Fund</strong>s can provide a balanced growth-and-income profile with a measured equity tilt.</li>\n<li>Rationale: these funds leverage diversification and opportunistic allocation to navigate market cycles.</li>\n</ul>\n</li>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Suitable for High-Risk Investors</p>\n<ul>\n<li><strong>Aggressive Hybrid Funds</strong> and <strong>Multi-Asset Allocation Funds</strong> with significant equity components.</li>\n<li>Rationale: higher growth potential comes with higher volatility, aligned with a longer time horizon and willingness to endure market swings.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"mcetoc_1jebu0275nj\" class=\"mb-2 whitespace-pre-wrap\">Other Considerations (Time Horizon, Tax, Costs)</h2>\n<ul>\n<li>Time horizon matters. Longer horizons can help smooth the impact of market downturns on riskier hybrids.</li>\n<li>Tax treatment varies with the fund type and underlying instruments. It is important to review the scheme information document for tax implications.</li>\n<li>Costs such as expense ratios influence net returns. In India, expense ratios for mutual funds are disclosed in the scheme documents and can differ by plan type (regular or direct).</li>\n<li>Managerial approach and track record matter. Experienced fund management can help navigate volatility and cycling markets.</li>\n<li>For investors, the goal is to use these vehicles to achieve a cleaner risk-adjusted path to your objectives rather than chasing short-term returns.</li>\n</ul>\n<h2 id=\"mcetoc_1jebu0275nk\" class=\"mb-2 whitespace-pre-wrap\">Summary / Key Takeaways</h2>\n<ul>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Risk Profile to Hybrid Type mapping:</p>\n<ul>\n<li>Low risk: Conservative Hybrid Funds, Arbitrage Funds</li>\n<li>Moderate risk: Balanced Hybrid Funds, Dynamic Asset Allocation Funds</li>\n<li>High risk: Aggressive Hybrid Funds, Multi-Asset Allocation Funds</li>\n</ul>\n</li>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Typical equity ranges (illustrative):</p>\n<ul>\n<li>Conservative Hybrid Funds: around 10–25% equity</li>\n<li>Balanced Hybrid Funds: around 40–60% equity</li>\n<li>Aggressive Hybrid Funds: around 65–80% equity</li>\n</ul>\n</li>\n<li>\n<p class=\"mb-2 whitespace-pre-wrap\">Always align your choice with time horizon, tax considerations, and cost impact. Use the risk map as a framework to compare options rather than a prescription.</p>\n</li>\n</ul>\n<h2 id=\"mcetoc_1jebu0275nl\" class=\"mb-2 whitespace-pre-wrap\">Frequently Asked Questions (FAQs)</h2>\n<ul>\n<li>\n<p>Q: What exactly is a hybrid fund?<br>A: A hybrid fund pools assets across stocks, debt, gold, cash etc. to seek growth while dampening volatility through diversification.</p>\n</li>\n<li>\n<p>Q: How do I map my risk tolerance to a hybrid fund type?<br>A: Start with your comfort level with volatility, your investment horizon, and income needs. Then compare the equity exposure of Conservative, Balanced, and Aggressive hybrids, along with dynamic and multi-asset options.</p>\n</li>\n<li>\n<p>Q: Are hybrid funds taxed differently from pure equity funds in India?<br>A: Tax treatment depends on the fund’s equity exposure and category, so review the scheme information and applicable guidelines.</p>\n</li>\n<li>\n<p>Q: What is a Balanced Advantage or Dynamic Asset Allocation fund?<br>A: These funds adjust allocations between equity and debt based on market conditions, aiming to balance growth with downside management.</p>\n</li>\n<li>\n<p>Q: How long should I stay invested in a hybrid fund?<br>A: A longer horizon generally helps when the fund has a higher equity tilt, but every investor should align with their plan and risk capacity.</p>\n</li>\n<li>\n<p>Q: What should I look for beyond risk mapping?<br>A: Consider the track record of the fund manager, diversification across assets, liquidity, and costs as part of your decision process.</p>\n</li>\n</ul>\n<p class=\"mb-2 whitespace-pre-wrap msg msg--warning\"><strong>Disclaimer:</strong> Mutual fund investments are subject to market risks. Read all scheme-related documents carefully before investing. Past performance is not indicative of future results. The content above is for educational and informational purposes only and should not be construed as investment advice.</p>\n<p class=\"mb-2 whitespace-pre-wrap\"> </p>",
            "image": "https://amberja.in/media/posts/69/india-hybrid-mutual-funds-3.png",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "What&#x27;s What in Finance"
            ],
            "date_published": "2026-01-07T15:23:26+05:30",
            "date_modified": "2026-01-07T16:21:43+05:30"
        },
        {
            "id": "https://amberja.in/vs-code-setup.html",
            "url": "https://amberja.in/vs-code-setup.html",
            "title": "VS Code Setup on MacOS",
            "summary": "I'm not a fulltime programmer, but given that I started my career&hellip;",
            "content_html": "<p>I'm not a fulltime programmer, but given that I started my career as a Backend &amp; Devops Engineer, I do code on hobbyist projects. Especially with LLMs, I'm trying to code more, and I have my reasons to use VS Code instead of Cursor or Claude Code (more on this someday!)</p>\n<p>Here is how I setup my VS code. I'm sure that most (if not all) of these settings could be configured in a config file, but I simply didnt had time to get around to it yet. So I do these steps manually at the moment:</p>\n<ul>\n<li>Disable Minimap scrollbar using:\n<ul>\n<li>View &gt; Appearance &gt; Deselect \"Minimap\" </li>\n</ul>\n</li>\n<li>Always enable Word Wrap: \n<ul>\n<li data-hveid=\"CAMQAQ\" data-processed=\"true\"><span class=\"T286Pc\" data-sfc-cp=\"\" data-processed=\"true\"><strong class=\"Yjhzub\" data-processed=\"true\">Code</strong> &gt; <strong class=\"Yjhzub\" data-processed=\"true\">Settings</strong>, or use the shortcut <code class=\"o8j0Mc\" dir=\"ltr\" data-processed=\"true\">Cmd + ,</code>.</span></li>\n<li data-hveid=\"CAMQAg\" data-processed=\"true\"><span class=\"T286Pc\" data-sfc-cp=\"\" data-processed=\"true\">In the search bar at the top, type \"word wrap\".</span></li>\n<li data-hveid=\"CAMQAw\" data-processed=\"true\"><span class=\"T286Pc\" data-sfc-cp=\"\" data-processed=\"true\">Under the <strong class=\"Yjhzub\" data-processed=\"true\">Editor: Word Wrap</strong> dropdown menu, select <strong class=\"Yjhzub\" data-processed=\"true\">on</strong>.</span><span class=\"uJ19be notranslate\" data-wiz-uids=\"cep5Rc_12,cep5Rc_13,cep5Rc_14\" data-processed=\"true\"><span class=\"vKEkVd\" data-animation-atomic=\"\" data-wiz-attrbind=\"class=cep5Rc_12/TKHnVd;\" data-processed=\"true\"> </span></span></li>\n</ul>\n</li>\n<li>Show \"Open files\" in sidebar:\n<ul>\n<li>Go to <code class=\"o8j0Mc\" dir=\"ltr\" data-processed=\"true\">View</code> &gt; <code class=\"o8j0Mc\" dir=\"ltr\" data-processed=\"true\">Appearance</code> &gt; <code class=\"o8j0Mc\" dir=\"ltr\" data-processed=\"true\">Primary Side Bar</code></li>\n<li>On Primary sidebar, choose \"Explorer\".</li>\n<li>Click three dots next to panel heading \"Explorer\". Select \"Open editors\"</li>\n</ul>\n</li>\n<li>Choose \n<ul>\n<li>Code &gt; Settings &gt; Themes &gt;  Color theme &gt; Choose \"Monokai\".</li>\n</ul>\n</li>\n</ul>\n<p> </p>",
            "image": "https://amberja.in/media/posts/67/visual-studio-code-banner-image.jpg",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Tech &amp; Programming",
                   "Blogposts",
                   "AI / LLMs"
            ],
            "date_published": "2025-12-30T23:48:52+05:30",
            "date_modified": "2025-12-31T00:10:11+05:30"
        },
        {
            "id": "https://amberja.in/mongodb-wiredtiger-corruption-a-cautionary-tale-of-adding-mcp-servers-to-librechat.html",
            "url": "https://amberja.in/mongodb-wiredtiger-corruption-a-cautionary-tale-of-adding-mcp-servers-to-librechat.html",
            "title": "MongoDB / WiredTiger Corruption: A Cautionary Tale of Adding MCP Servers to LibreChat",
            "summary": "<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7] msg msg--highlight \"><em>How a simple MCP config change crashed my entire LibreChat setup - twice</em></p>\n<p>Sometimes the most frustrating bugs are the ones that punch you in the face twice before you learn to duck. I ran into a somewhat mysterious issue while trying to integrate the Pal MCP server (formerly known as Zen MCP server) into my local LibreChat install on my Macbook. What should have been a straightforward configuration change ended up corrupting MongoDB and taking down my entire local LLM infrastructure. Twice. </p>\n",
            "content_html": "<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7] msg msg--highlight \"><em>How a simple MCP config change crashed my entire LibreChat setup - twice</em></p>\n<p>Sometimes the most frustrating bugs are the ones that punch you in the face twice before you learn to duck. I ran into a somewhat mysterious issue while trying to integrate the Pal MCP server (formerly known as Zen MCP server) into my local LibreChat install on my Macbook. What should have been a straightforward configuration change ended up corrupting MongoDB and taking down my entire local LLM infrastructure. Twice. </p>\n\n<p>In this blogpost, I will document how Pal MCP + LibreChat caused MongoDB to catastrophically fail - not once, but twice - and how I worked around it.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jdo6bmlq225\">Context</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq226\">The Setup That Should Have Worked</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq227\">The Diagnosis 🩺</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq228\">The Fix (Nuclear Option 💣)</a></li>\n<li><a href=\"#toc_5\">The Mystery Remains 🕵🏻‍♂️</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq229\">The Problem</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq22a\">Solution</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq22b\">What's Next</a>\n<ul>\n<li><a href=\"#mcetoc_1jdo6bmlq22c\">LibreChat's Chain of Agents</a></li>\n<li><a href=\"#mcetoc_1jdo6bmlq22d\">Pal MCP's Council of LLMs</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1jdo6bmlq225\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">Context</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I use <a href=\"https://librechat.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">LibreChat</a> as a core part of my LLM workflows. If you're not familiar with it, LibreChat is a self-hosted chat interface that lets you work with multiple LLM providers via it's integration with <a href=\"https://openrouter.ai/\" target=\"_blank\" rel=\"noopener noreferrer\">Openrouter</a>. I run it via Docker Compose on my Mac, which spins up several containers including MongoDB for data persistence.</p>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I also rely heavily on the <a href=\"https://github.com/BeehiveInnovations/pal-mcp-server\" target=\"_blank\" rel=\"noopener noreferrer\">Pal MCP server</a> for \"council of LLMs\" - essentially getting multiple models to weigh in on problems, debate solutions, and reach consensus. It's become indispensable for complex reasoning tasks, especially for controversial topics - rangingfrom:</p>\n<ul>\n<li>the petty ones (\"is a hot dog a sandwich?\" or \"is chocolate actually healthy?\")</li>\n<li>to contentious / polarizing / thornier questions like gun control policy, climate policy trade-offs, the ethics of capital punishment, whether military intervention can ever be justified, abortion rights, cryptocurrency regulation, immigration reforms or when (if ever) war is morally defensible.</li>\n</ul>\n<p>Having multiple models debate these issues surfaces blind spots and steelmans arguments I'd otherwise miss. When models disagree, I learn more than when they don't.</p>\n<h2 id=\"mcetoc_1jdo6bmlq226\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">The Setup That Should Have Worked</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I was trying to integrate the Pal MCP server (formerly known as Zen MCP server) into my LibreChat installation. The configuration seemed straightforward enough - just add the appropriate settings to <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">librechat.yaml</code> and restart the containers.</p>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">What could go wrong? Well, everything.</p>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I added the Pal MCP server configuration to my <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">librechat.yaml</code>:</p>\n<div class=\"relative group/copy bg-bg-000/50 border-0.5 border-border-400 rounded-lg\">\n<div class=\"sticky opacity-0 group-hover/copy:opacity-100 top-2 py-2 h-12 w-0 float-right\">\n<div class=\"absolute right-0 h-8 px-2 items-center inline-flex z-10\">\n<div class=\"relative\">\n<div class=\"flex items-center justify-center transition-all opacity-100 scale-100\"> </div>\n<div class=\"flex items-center justify-center absolute top-0 left-0 transition-all opacity-0 scale-50\">\n<pre class=\"language-yaml\"><code>mcpServers:\n  pal:\n    command: sh\n    args:\n      - -c\n      - \"for p in $(which uvx 2&gt;/dev/null) $HOME/.local/bin/uvx /opt/homebrew/bin/uvx /usr/local/bin/uvx uvx; do [ -x \\\"$p\\\" ] &amp;&amp; exec \\\"$p\\\" --from git+https://github.com/BeehiveInnovations/pal-mcp-server.git pal-mcp-server; done; echo 'uvx not found' &gt;&amp;2; exit 1\"\n    env:\n      PATH: \"/usr/local/bin:/usr/bin:/bin:/opt/homebrew/bin:~/.local/bin\"\n      OPENROUTER_API_KEY: \"&lt;INSERT_KEY_HERE&gt;\"</code></pre>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">After updating the config and restarting the containers, MongoDB's Docker container refused to boot. The logs revealed something ugly:</p>\n<pre class=\"language-apacheconf\"><code>{\"t\":{\"$date\":\"2025-12-23T19:01:11.620+00:00\"},\"s\":\"E\",  \"c\":\"WT\",       \"id\":22435,   \"ctx\":\"initandlisten\",\"msg\":\"WiredTiger error message\",\"attr\":{\"error\":-31802,\"message\":{\"ts_sec\":1766516471,\"ts_usec\":620540,\"thread\":\"1:0x7fb37d73e400\",\"session_dhandle_name\":\"file:WiredTiger.wt\",\"session_name\":\"connection\",\"category\":\"WT_VERB_DEFAULT\",\"log_id\":1000000,\"category_id\":12,\"verbose_level\":\"ERROR\",\"verbose_level_id\":-3,\"msg\":\"__wti_block_read_off:308:WiredTiger.wt: fatal read error\",\"error_str\":\"WT_ERROR: non-specific WiredTiger error\",\"error_code\":-31802}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.620+00:00\"},\"s\":\"E\",  \"c\":\"WT\",       \"id\":22435,   \"ctx\":\"initandlisten\",\"msg\":\"WiredTiger error message\",\"attr\":{\"error\":-31804,\"message\":{\"ts_sec\":1766516471,\"ts_usec\":620606,\"thread\":\"1:0x7fb37d73e400\",\"session_dhandle_name\":\"file:WiredTiger.wt\",\"session_name\":\"connection\",\"category\":\"WT_VERB_DEFAULT\",\"log_id\":1000000,\"category_id\":12,\"verbose_level\":\"ERROR\",\"verbose_level_id\":-3,\"msg\":\"__wti_block_read_off:308:the process must exit and restart\",\"error_str\":\"WT_PANIC: WiredTiger library panic\",\"error_code\":-31804}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.620+00:00\"},\"s\":\"F\",  \"c\":\"ASSERT\",   \"id\":23089,   \"ctx\":\"initandlisten\",\"msg\":\"Fatal assertion\",\"attr\":{\"msgid\":50853,\"location\":\"src/mongo/db/storage/wiredtiger/wiredtiger_util.cpp:644:9:int mongo::{anonymous}::mdb_handle_error_with_startup_suppression(WT_EVENT_HANDLER*, WT_SESSION*, int, const char*)\"}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.620+00:00\"},\"s\":\"F\",  \"c\":\"ASSERT\",   \"id\":23090,   \"ctx\":\"initandlisten\",\"msg\":\"\\n\\n***aborting after fassert() failure\\n\\n\"}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.620+00:00\"},\"s\":\"F\",  \"c\":\"CONTROL\",  \"id\":6384300, \"ctx\":\"initandlisten\",\"msg\":\"Writing fatal message\",\"attr\":{\"message\":\"Got signal: 6 (Aborted).\\n\"}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31380,   \"ctx\":\"initandlisten\",\"msg\":\"BACKTRACE\",\"attr\":{\"bt\":{\"backtrace\":[{\"a\":\"563CE7A76D47\",\"b\":\"563CDDB8E000\",\"o\":\"9EE8D47\",\"s\":\"_ZN5mongo15printStackTraceEv\",\"C\":\"mongo::printStackTrace()\",\"s+\":\"37\"},{\"a\":\"563CE7A55C45\",\"b\":\"563CDDB8E000\",\"o\":\"9EC7C45\",\"s\":\"_ZN5mongo12_GLOBAL__N_115printErrorBlockEv\",\"C\":\"mongo::(anonymous namespace)::printErrorBlock()\",\"s+\":\"225\"},{\"a\":\"563CE7A55D55\",\"b\":\"563CDDB8E000\",\"o\":\"9EC7D55\",\"s\":\"abruptQuit\",\"s+\":\"85\"},{\"a\":\"7FB37E203330\",\"b\":\"7FB37E1BE000\",\"o\":\"45330\"},{\"a\":\"7FB37E25CB2C\",\"b\":\"7FB37E1BE000\",\"o\":\"9EB2C\",\"s\":\"pthread_kill\",\"s+\":\"11C\"},{\"a\":\"7FB37E20327E\",\"b\":\"7FB37E1BE000\",\"o\":\"4527E\",\"s\":\"gsignal\",\"s+\":\"1E\"},{\"a\":\"7FB37E1E68FF\",\"b\":\"7FB37E1BE000\",\"o\":\"288FF\",\"s\":\"abort\",\"s+\":\"DF\"},{\"a\":\"563CE7A43F70\",\"b\":\"563CDDB8E000\",\"o\":\"9EB5F70\",\"s\":\"_ZN5mongo12_GLOBAL__N_19callAbortEv\",\"C\":\"mongo::(anonymous namespace)::callAbort()\",\"s+\":\"3C\"},{\"a\":\"563CE7A46631\",\"b\":\"563CDDB8E000\",\"o\":\"9EB8631\",\"s\":\"_ZN5mongo14fassert_detail6failedENS0_5MsgIdENS_24WrappedStdSourceLocationE\",\"C\":\"mongo::fassert_detail::failed(mongo::fassert_detail::MsgId, mongo::WrappedStdSourceLocation)\",\"s+\":\"F9\"},{\"a\":\"563CE28D4FA5\",\"b\":\"563CDDB8E000\",\"o\":\"4D46FA5\",\"s\":\"_ZN5mongo12_GLOBAL__N_141mdb_handle_error_with_startup_suppressionEP18__wt_event_handlerP12__wt_sessioniPKc.cold\",\"C\":\"mongo::(anonymous namespace)::mdb_handle_error_with_startup_suppression(__wt_event_handler*, __wt_session*, int, char const*) [clone .cold]\",\"s+\":\"11\"},{\"a\":\"563CE2A81E00\",\"b\":\"563CDDB8E000\",\"o\":\"4EF3E00\",\"s\":\"__eventv\",\"s+\":\"1310\"},{\"a\":\"563CE2A82284\",\"b\":\"563CDDB8E000\",\"o\":\"4EF4284\",\"s\":\"__wt_panic_func\",\"s+\":\"156\"},{\"a\":\"563CE28E86BD\",\"b\":\"563CDDB8E000\",\"o\":\"4D5A6BD\",\"s\":\"__wti_block_read_off.cold\",\"s+\":\"134\"},{\"a\":\"563CE2069C96\",\"b\":\"563CDDB8E000\",\"o\":\"44DBC96\",\"s\":\"__wti_block_extlist_read\",\"s+\":\"96\"},{\"a\":\"563CE28DF06F\",\"b\":\"563CDDB8E000\",\"o\":\"4D5106F\",\"s\":\"__wti_block_checkpoint_extlist_dump\",\"s+\":\"22F\"},{\"a\":\"563CE1E7410E\",\"b\":\"563CDDB8E000\",\"o\":\"42E610E\",\"s\":\"__wti_block_read_off\",\"s+\":\"3AE\"},{\"a\":\"563CE2069C96\",\"b\":\"563CDDB8E000\",\"o\":\"44DBC96\",\"s\":\"__wti_block_extlist_read\",\"s+\":\"96\"},{\"a\":\"563CE28E5ACB\",\"b\":\"563CDDB8E000\",\"o\":\"4D57ACB\",\"s\":\"__wti_block_extlist_read_avail\",\"s+\":\"2B\"},{\"a\":\"563CE28DE78C\",\"b\":\"563CDDB8E000\",\"o\":\"4D5078C\",\"s\":\"__wt_block_checkpoint_load\",\"s+\":\"2AC\"},{\"a\":\"563CE28F45D9\",\"b\":\"563CDDB8E000\",\"o\":\"4D665D9\",\"s\":\"__bm_checkpoint_load\",\"s+\":\"39\"},{\"a\":\"563CE291279B\",\"b\":\"563CDDB8E000\",\"o\":\"4D8479B\",\"s\":\"__wt_btree_open\",\"s+\":\"E6B\"},{\"a\":\"563CE297D609\",\"b\":\"563CDDB8E000\",\"o\":\"4DEF609\",\"s\":\"__wt_conn_dhandle_open\",\"s+\":\"379\"},{\"a\":\"563CE1FE2298\",\"b\":\"563CDDB8E000\",\"o\":\"4454298\",\"s\":\"__wt_session_get_dhandle\",\"s+\":\"C8\"},{\"a\":\"563CE1FE267A\",\"b\":\"563CDDB8E000\",\"o\":\"445467A\",\"s\":\"__wt_session_get_dhandle\",\"s+\":\"4AA\"},{\"a\":\"563CE1FE2157\",\"b\":\"563CDDB8E000\",\"o\":\"4454157\",\"s\":\"__wt_session_get_btree_ckpt\",\"s+\":\"7C7\"},{\"a\":\"563CE1E10C57\",\"b\":\"563CDDB8E000\",\"o\":\"4282C57\",\"s\":\"__wt_curfile_open\",\"s+\":\"177\"},{\"a\":\"563CE2A6CB59\",\"b\":\"563CDDB8E000\",\"o\":\"4EDEB59\",\"s\":\"__session_open_cursor_int\",\"s+\":\"599\"},{\"a\":\"563CE1E3D536\",\"b\":\"563CDDB8E000\",\"o\":\"42AF536\",\"s\":\"__wt_open_cursor\",\"s+\":\"56\"},{\"a\":\"563CE1F943D0\",\"b\":\"563CDDB8E000\",\"o\":\"44063D0\",\"s\":\"__wt_metadata_cursor_open\",\"s+\":\"70\"},{\"a\":\"563CE1F65869\",\"b\":\"563CDDB8E000\",\"o\":\"43D7869\",\"s\":\"__wt_metadata_cursor\",\"s+\":\"49\"},{\"a\":\"563CE29773A8\",\"b\":\"563CDDB8E000\",\"o\":\"4DE93A8\",\"s\":\"wiredtiger_open\",\"s+\":\"1EE8\"},{\"a\":\"563CE289FFC9\",\"b\":\"563CDDB8E000\",\"o\":\"4D11FC9\",\"s\":\"_ZN5mongo18WiredTigerKVEngine15_openWiredTigerERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_\",\"C\":\"mongo::WiredTigerKVEngine::_openWiredTiger(std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; const&amp;, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; const&amp;)\",\"s+\":\"79\"},{\"a\":\"563CE28ACC12\",\"b\":\"563CDDB8E000\",\"o\":\"4D1EC12\",\"s\":\"_ZN5mongo18WiredTigerKVEngineC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_PNS_11ClockSourceENS_22WiredTigerKVEngineBase16WiredTigerConfigERKNS_20WiredTigerExtensionsEbbbb\",\"C\":\"mongo::WiredTigerKVEngine::WiredTigerKVEngine(std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; const&amp;, std::__cxx11::basic_string&lt;char, std::char_traits&lt;char&gt;, std::allocator&lt;char&gt; &gt; const&amp;, mongo::ClockSource*, mongo::WiredTigerKVEngineBase::WiredTigerConfig, mongo::WiredTigerExtensions const&amp;, bool, bool, bool, bool)\",\"s+\":\"812\"},{\"a\":\"563CE285B81A\",\"b\":\"563CDDB8E000\",\"o\":\"4CCD81A\",\"s\":\"_ZNK5mongo12_GLOBAL__N_117WiredTigerFactory6createEPNS_16OperationContextERKNS_19StorageGlobalParamsEPKNS_21StorageEngineLockFileEbbb\",\"C\":\"mongo::(anonymous namespace)::WiredTigerFactory::create(mongo::OperationContext*, mongo::StorageGlobalParams const&amp;, mongo::StorageEngineLockFile const*, bool, bool, bool) const\",\"s+\":\"2DA\"},{\"a\":\"563CE3D9960C\",\"b\":\"563CDDB8E000\",\"o\":\"620B60C\",\"s\":\"_ZN5mongo23initializeStorageEngineEPNS_16OperationContextENS_22StorageEngineInitFlagsEbbbPNS_14BSONObjBuilderE\",\"C\":\"mongo::initializeStorageEngine(mongo::OperationContext*, mongo::StorageEngineInitFlags, bool, bool, bool, mongo::BSONObjBuilder*)\",\"s+\":\"44C\"},{\"a\":\"563CE3D42477\",\"b\":\"563CDDB8E000\",\"o\":\"61B4477\",\"s\":\"_ZN5mongo7catalog40startUpStorageEngineAndCollectionCatalogEPNS_14ServiceContextEPNS_6ClientENS_22StorageEngineInitFlagsEPNS_14BSONObjBuilderE\",\"C\":\"mongo::catalog::startUpStorageEngineAndCollectionCatalog(mongo::ServiceContext*, mongo::Client*, mongo::StorageEngineInitFlags, mongo::BSONObjBuilder*)\",\"s+\":\"E7\"},{\"a\":\"563CE20B7B96\",\"b\":\"563CDDB8E000\",\"o\":\"4529B96\",\"s\":\"_ZN5mongo12_GLOBAL__N_114_initAndListenEPNS_14ServiceContextE\",\"C\":\"mongo::(anonymous namespace)::_initAndListen(mongo::ServiceContext*)\",\"s+\":\"6D6\"},{\"a\":\"563CE20BA092\",\"b\":\"563CDDB8E000\",\"o\":\"452C092\",\"s\":\"_ZN5mongo12_GLOBAL__N_113initAndListenEPNS_14ServiceContextE\",\"C\":\"mongo::(anonymous namespace)::initAndListen(mongo::ServiceContext*)\",\"s+\":\"22\"},{\"a\":\"563CE20BF78E\",\"b\":\"563CDDB8E000\",\"o\":\"453178E\",\"s\":\"_ZN5mongo11mongod_mainEiPPc\",\"C\":\"mongo::mongod_main(int, char**)\",\"s+\":\"E1E\"},{\"a\":\"563CE20A80E7\",\"b\":\"563CDDB8E000\",\"o\":\"451A0E7\",\"s\":\"main\",\"s+\":\"9\"},{\"a\":\"7FB37E1E81CA\",\"b\":\"7FB37E1BE000\",\"o\":\"2A1CA\"},{\"a\":\"7FB37E1E828B\",\"b\":\"7FB37E1BE000\",\"o\":\"2A28B\",\"s\":\"__libc_start_main\",\"s+\":\"8B\"},{\"a\":\"563CE20A7FC5\",\"b\":\"563CDDB8E000\",\"o\":\"4519FC5\",\"s\":\"_start\",\"s+\":\"25\"}],\"processInfo\":{\"mongodbVersion\":\"8.2.2\",\"gitVersion\":\"594f839ceec1f4385be9a690131412d67b249a0a\",\"compiledModules\":[],\"uname\":{\"sysname\":\"Linux\",\"release\":\"6.12.54-linuxkit\",\"version\":\"#1 SMP PREEMPT_DYNAMIC Tue Nov  4 21:39:03 UTC 2025\",\"machine\":\"x86_64\"},\"somap\":[{\"b\":\"563CDDB8E000\",\"path\":\"/usr/bin/mongod\",\"elfType\":3,\"buildId\":\"9EE04132F3F41053B388D9BA9B3762DCB713C1A4\"},{\"b\":\"7FB37E1BE000\",\"path\":\"/lib/x86_64-linux-gnu/libc.so.6\",\"elfType\":3,\"buildId\":\"274EEC488D230825A136FA9C4D85370FED7A0A5E\"}]}}},\"tags\":[]}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"563CE7A76D47\",\"b\":\"563CDDB8E000\",\"o\":\"9EE8D47\",\"s\":\"_ZN5mongo15printStackTraceEv\",\"C\":\"mongo::printStackTrace()\",\"s+\":\"37\"}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"563CE7A55C45\",\"b\":\"563CDDB8E000\",\"o\":\"9EC7C45\",\"s\":\"_ZN5mongo12_GLOBAL__N_115printErrorBlockEv\",\"C\":\"mongo::(anonymous namespace)::printErrorBlock()\",\"s+\":\"225\"}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"563CE7A55D55\",\"b\":\"563CDDB8E000\",\"o\":\"9EC7D55\",\"s\":\"abruptQuit\",\"s+\":\"85\"}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"7FB37E203330\",\"b\":\"7FB37E1BE000\",\"o\":\"45330\"}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"7FB37E25CB2C\",\"b\":\"7FB37E1BE000\",\"o\":\"9EB2C\",\"s\":\"pthread_kill\",\"s+\":\"11C\"}}}\n\n{\"t\":{\"$date\":\"2025-12-23T19:01:11.912+00:00\"},\"s\":\"I\",  \"c\":\"CONTROL\",  \"id\":31445,   \"ctx\":\"initandlisten\",\"msg\":\"Frame\",\"attr\":{\"frame\":{\"a\":\"7FB37E20327E\",\"b\":\"7FB37E1BE000\",\"o\":\"4527E\",\"s\":\"gsignal\",\"s+\":\"1E\"}}}</code></pre>\n<h2 id=\"mcetoc_1jdo6bmlq227\">The Diagnosis 🩺</h2>\n<p>After feeding the logs to Claude, the verdict was clear: WiredTiger storage engine corruption causing MongoDB to crash with a segmentation fault (error code 139).<br><br>The key errors in the logs were:</p>\n<blockquote>\n<p>This is a WiredTiger storage engine corruption issue causing MongoDB to crash. Error code 139 indicates a segmentation fault (SIGSEGV). The key error is: WT_PANIC: WiredTiger library panic</p>\n<p>fatal read error on WiredTiger.wt</p>\n<p>the process must exit and restart</p>\n</blockquote>\n<p>WiredTiger is MongoDB's default storage engine, and when it panics like this, your data is <em><strong>likely</strong></em> compromised. The corruption was severe enough that MongoDB container was stuck in a bootloop.</p>\n<h2 id=\"mcetoc_1jdo6bmlq228\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">The Fix (Nuclear Option 💣)</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\"><strong>Warning: This solution causes data loss. Back up everything first if you have any hope of recovery.</strong></p>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">Since the database was corrupted beyond repair, I had to nuke everything and start fresh:</p>\n<p class=\"msg msg--warning\">DANGER AHEAD! PROCEED WITH CAUTION</p>\n<pre class=\"language-bash\"><code># Stop all containers and remove volumes\ndocker-compose down -v\n\n# Remove orphaned volumes\ndocker volume prune -f\n\n# Check what's left\ndocker volume ls\n\n# The nuclear option - removes everything\ndocker system prune -a --volumes</code></pre>\n<p>That last command is particularly destructive. It removes:</p>\n<ul>\n<li>all stopped containers</li>\n<li>all networks not used by at least one container</li>\n<li>all anonymous volumes not used by at least one container</li>\n<li>all images without at least one container associated to them</li>\n<li>all build cache</li>\n</ul>\n<p>After the purge, I rebuilt everything from scratch:</p>\n<div>\n<pre class=\"language-bash\"><code>docker compose up -d</code></pre>\n<p>LibreChat came back up with a fresh MongoDB instance. All my chat history was gone, but at least it was working.</p>\n<h2 id=\"toc_5\">The Mystery Remains 🕵🏻‍♂️</h2>\n<p>Here's the frustrating part: I still don't know <em>why</em> adding the Pal MCP server configuration corrupted MongoDB. My common sense tells me that the config change shouldn't have touched the database at all. </p>\n<p>The fact that it happened twice with the same config change suggests it's not random, but I haven't been able to pin down the root cause (yet!).</p>\n<p>Here's what Sonnet 4.5 told me to try (which I haven't tried yet):</p>\n<blockquote>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">The issue is with your PAL MCP server configuration - specifically the <strong>shell command and path handling</strong>. The complex shell script is likely causing resource issues or hanging during startup, which is blocking MongoDB initialization.</p>\n<h2 id=\"mcetoc_1jdo6bmlq229\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">The Problem</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">Your PAL MCP config uses a shell loop that:</p>\n<ol class=\"[li_&amp;]:mb-0 [li_&amp;]:mt-1.5 [li_&amp;]:gap-1.5 [&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-decimal flex flex-col gap-2 pl-8 mb-3\">\n<li class=\"whitespace-normal break-words pl-2\">Searches multiple paths for <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">uvx</code></li>\n<li class=\"whitespace-normal break-words pl-2\">Clones and installs from git</li>\n<li class=\"whitespace-normal break-words pl-2\">Has <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">~/.local/bin</code> in PATH (tilde expansion doesn't work in Docker)</li>\n</ol>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">This is probably timing out or consuming resources during container startup, preventing MongoDB from initializing properly.</p>\n<h2 id=\"mcetoc_1jdo6bmlq22a\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">Solution</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">Replace your PAL MCP configuration with a simpler, Docker-friendly approach:</p>\n<pre class=\"language-yaml\"><code>mcpServers:\n  pal:\n    command: uvx\n    args:\n      - --from\n      - git+https://github.com/BeehiveInnovations/pal-mcp-server.git\n      - pal-mcp-server\n    env:\n      OPENROUTER_API_KEY: \"&lt;INSERT_KEY_HERE&gt;\"</code></pre>\n<p> </p>\n</blockquote>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\"> </p>\n<h2 id=\"mcetoc_1jdo6bmlq22b\" class=\"text-text-100 mt-3 -mb-1 text-[1.125rem] font-bold\">What's Next</h2>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I'm now back to square one: LibreChat running without the Pal MCP integration. Both tools are essential to my workflow:</p>\n<h3 id=\"mcetoc_1jdo6bmlq22c\" class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\"><strong>LibreChat's Chain of Agents</strong></h3>\n<p>I also depend heavily on LibreChat's no-code <a href=\"https://www.librechat.ai/docs/features/agents#agent-chain\" target=\"_blank\" rel=\"noopener noreferrer\">Agent Chain</a> - Think <a href=\"https://en.wikipedia.org/wiki/Pipeline_(Unix)\" target=\"_blank\" rel=\"noopener noreferrer\">Unix pipes</a>, but for LLMs! But in this case, think of each prompt-model combo as a Unix command doing one job. LibreChat's <em>Agent Chain</em> is just the pipe between them - carrying output from one prompt to the next.</p>\n<p>In other words: Agent chain is a no-code pipeline of multiple prompts, where each prompt  does one thing and does it well (via a specific LLM model that specializes for that task), and hands off it's output to the next... </p>\n<blockquote>\n<p>In <a href=\"https://en.wikipedia.org/wiki/Unix_philosophy#Origin\" target=\"_blank\" rel=\"noopener noreferrer\">Unix Philosophy</a>: <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">cat file.txt | transform | format</code> chains commands via pipes.</p>\n<p>In LibreChat: <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">extraction prompt (via gpt5.2) → analyze (via sonnet 4.5) → summarize (via gemini 3.5 pro)</code> chains prompt-model combos via the agent chain.</p>\n</blockquote>\n<h3 id=\"mcetoc_1jdo6bmlq22d\" class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\"><strong>Pal MCP's Council of LLMs</strong></h3>\n<p>For complex decisions, I want multiple models with different perspectives to analyze the problem. Pal MCP makes this possible by orchestrating multi-model consensus.</p>\n<p class=\"font-claude-response-body break-words whitespace-normal leading-[1.7]\">I have updated this post with instructions to safely add Pal MCP to LibreChat without corrupting everything. <span style=\"text-decoration: line-through;\">If you've successfully integrated these two tools, I'd love to hear how you did it.</span></p>\n<p><span style=\"text-decoration: line-through;\">Have you experienced similar issues with LibreChat, MCP servers, or MongoDB in Docker?  Reach out - I'm curious if this is a known issue or if I'm just uniquely unlucky.</span></p>\n<p><span style=\"text-decoration: line-through;\">I might (or might not) update this blog post if and when I figure out how to configure Pal MCP inside LibreChat. For now, they run separately; Pal MCP in Claude code, and my MongoDB sleeps peacefully.</span></p>\n<h2>How to get Pal MCP working in librachat:</h2>\n<p>This is how my bare minimal <code>librechat.yaml</code> looks like (feel free to remove parts that you dont need). Make sure to replace <code>&lt;INSERT_OPENROUTER_KEY_HERE&gt;</code> with your Openrouter API key:</p>\n<pre class=\"language-yaml\"><code>version: 1.2.8\ncache: true\nendpoints:\n  agents:\n    recursionLimit: 100        # increase default agent steps to 50\n    maxRecursionLimit: 500    # allow up to 100 if adjusting via UI\n  custom:\n    - name: \"OpenRouter\"\n      apiKey: \"&lt;INSERT_OPENROUTER_KEY_HERE&gt;\"\n      baseURL: \"https://openrouter.ai/api/v1\"\n      models:\n        default: [\"gpt-3.5-turbo\"]\n        fetch: true\n      titleConvo: true\n      titleModel: \"current_model\"\n      summarize: false\n      summaryModel: \"current_model\"\n      forcePrompt: false\n      modelDisplayLabel: \"OpenRouter\"\nmcpServers:\n  memory:\n    command: npx\n    args:\n      - -y\n      - \"@modelcontextprotocol/server-memory\"\n  pal:\n    command: uvx\n    args:\n      - --from\n      - git+https://github.com/BeehiveInnovations/pal-mcp-server.git\n      - pal-mcp-server\n    env:\n      OPENROUTER_API_KEY: \"&lt;INSERT_OPENROUTER_KEY_HERE&gt;\"</code></pre>\n<p>The snippet for <span style=\"font-size: inherit;\"><code>maxRecursionLimit</code> and <code>recursionLimit</code> </span><span style=\"font-size: inherit;\">is to fix if you get this error (Click <a href=\"https://www.librechat.ai/docs/configuration/librechat_yaml/object_structure/agents\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> and <a href=\"https://www.librechat.ai/docs/features/agents#max-agent-steps\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> for more info):</span></p>\n<p class=\"msg msg--warning\">Something went wrong. Here's the specific error message we encountered: An error occurred while processing the request: Recursion limit of 25 reached without hitting a stop condition. You can increase the limit by setting the \"recursionLimit\" config key. Troubleshooting URL: https://langchain-ai.github.io/langgraphjs/troubleshooting/errors/GRAPH_RECURSION_LIMIT/ </p>\n<p> </p>\n<p>And this is my docker-compose.override.yml :</p>\n<pre class=\"language-yaml\"><code>services:\n  api:\n    volumes:\n      - type: bind\n        source: ./librechat.yaml\n        target: /app/librechat.yaml\n    command: sh -c \"apk add --no-cache git &amp;&amp; pip install --break-system-packages uv &amp;&amp; npm run backend\"</code></pre>\n</div>",
            "image": "https://amberja.in/media/posts/66/9aff2fb2-librechat.jpg",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Tech &amp; Programming",
                   "Blogposts",
                   "AI / LLMs"
            ],
            "date_published": "2025-12-30T22:25:42+05:30",
            "date_modified": "2026-01-05T13:49:00+05:30"
        },
        {
            "id": "https://amberja.in/car-insurance-in-india-checklists-during-buying-renewing-beforeafter-a-claim.html",
            "url": "https://amberja.in/car-insurance-in-india-checklists-during-buying-renewing-beforeafter-a-claim.html",
            "title": "Car Insurance in India: Checklists during buying, renewing, before/after a claim",
            "summary": "Every year I have to renew car insurance, I quickly scan this&hellip;",
            "content_html": "<p>Every year I have to renew car insurance, I quickly scan this checklist to make sure that I have got maximum coverage for my car, without overpaying for useless addons.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jc3msljlas\">Buying or renewing</a></li>\n<li><a href=\"#mcetoc_1jc3msljlat\">During a claim</a></li>\n<li><a href=\"#mcetoc_1jc3msljlau\">After a claim</a></li>\n<li><a href=\"#mcetoc_1jc3msljlav\">Other addons/covers that I have NOT tried myself but might be useful:</a></li>\n</ul>\n</div>\n<p> </p>\n<h2 id=\"mcetoc_1jc3msljlas\">Buying or renewing</h2>\n<ul>\n<li>Choose your IDV\n<ul>\n<li><span style=\"color: #e03e2d;\">Maximize always?</span></li>\n<li>Higher IDVs only serve to raise the premium. Payout in case of total loss will be as per depreciated value of the vehicle. It is best not to inflate IDV unnecessarily. Use the <a rel=\"ugc noopener\" href=\"https://idv.gicouncil.in/\" target=\"_blank\">IDV calculator</a> from the General Insurance Council to get an idea of the ideal IDV for your vehicle. (Source: <a href=\"https://www.team-bhp.com/forum/indian-car-loans-insurance/238024-car-insurance-return-invoice-vs-idv.html#post5082378\" target=\"_blank\" rel=\"noopener noreferrer\">team-bhp comment</a>) Is this true?</li>\n<li>See also content at bottom of this page: <a href=\"https://idv.gicouncil.in/\">https://idv.gicouncil.in/</a></li>\n<li>If am getting RTI, I keep the IDV low. If no RTI, the highest IDV possible. (Source: <a href=\"https://www.team-bhp.com/forum/indian-car-loans-insurance/238024-car-insurance-return-invoice-vs-idv.html#post5082454\" target=\"_blank\" rel=\"noopener noreferrer\">team-bhp comment</a>)</li>\n</ul>\n</li>\n<li>If you are renewing and you haven't registered a claim in previous year, make sure that you are getting a no claims bonus (discount) on your premium.\n<ul>\n<li>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"1\">\n<tbody>\n<tr>\n<td width=\"286\">\n<p>After year one of no claim</p>\n</td>\n<td width=\"286\">\n<p>20%</p>\n</td>\n</tr>\n<tr>\n<td width=\"286\">\n<p>After two consecutive years of no claim</p>\n</td>\n<td width=\"286\">\n<p>25%</p>\n</td>\n</tr>\n<tr>\n<td width=\"286\">\n<p>After three consecutive years of no claim</p>\n</td>\n<td width=\"286\">\n<p>35%</p>\n</td>\n</tr>\n<tr>\n<td width=\"286\">\n<p>After four consecutive years of no claim</p>\n</td>\n<td width=\"286\">\n<p>45%</p>\n</td>\n</tr>\n<tr>\n<td width=\"286\">\n<p>After five consecutive years of no claim</p>\n</td>\n<td width=\"286\">\n<p>50%</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ul>\n</li>\n<li>Buy both Own Damage (OD) and Third party (TP)\n<ul>\n<li><span style=\"color: #e03e2d;\">Is this comprehensive cover?</span></li>\n</ul>\n</li>\n<li>Buy Zero depreciation (also known as \"Zero dep\")\n<ul>\n<li><span style=\"color: #e03e2d;\">Is this same as bumper to bumper?</span></li>\n<li>Usually offered only for first 5 years.\n<ul>\n<li>So when you are renewing at the end of 4th year, if you have an option to buy for \"3 years\" (with zero depreciation included for 5th, 6th and 7th year), opt for it. I forgot to do this.</li>\n<li>So when HDFC refused to offer this in 6th year, I checked other insurers and ICICI was offering this. So I switched my insurer, and bought a 3 year policy with zero depreciation included from ICICI (now my car has zero dep for 6th, 7th and 8th year).</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Buy NCB (no claims bonus) protection addon\n<ul>\n<li>This add-on cover lets you keep your NCB discount intact even if you raise any claim request up to a certain pre-decided limit.</li>\n</ul>\n</li>\n<li>PA (Personal Accident) Cover for driver:\n<ul>\n<li>15L is mandatory by law in India for every <span style=\"text-decoration: underline;\">driver</span>. But don't buy this for <span style=\"text-decoration: underline;\">passengers</span>.</li>\n<li>Don't buy more than 15L, as this cover is rejected for stupidiest of reasons (unlike a Term Insurance policy). I have seen Acko offering a higher cover, but I don't recommend it.</li>\n<li>If you already have this cover on any vehicle, you don't need to buy it again (e.g. I have this on my Activa bike insurance, so I haven't bought this for my car).</li>\n</ul>\n</li>\n<li>Return to Invoice (RTI) addon:\n<ul>\n<li>Applies in case of theft as well as total loss (accident or natural calamity)</li>\n<li>Usually available for the first 3 to 5 years of buying the car (This is because paying the ‘On Road’ price for an aged vehicle will convert into a financial loss for the insurance provider.)</li>\n<li>Take it, if available for as many years as you can.</li>\n<li>By bridging the gap between the vehicle and its Insured Declared Value and the actual invoice value, you are liable to be reimbursed for the total ‘On-road’ price of the vehicle you paid when you purchased it.</li>\n<li><strong>Full Reimbursement of Invoice Value</strong>: Ensures you get back the complete amount spent on purchasing the car, including taxes and registration fees.</li>\n<li><strong>Protection Against Depreciation</strong>: Shields policyholders from the impact of depreciation, which reduces the car's market value over time.</li>\n<li>Keeping the car’s purchase invoice is crucial for claims.</li>\n</ul>\n</li>\n<li>Compulsary/mandatory deductible: The premium amount of the car insurance is not affected by the amount of compulsory deductible.\n<ul>\n<li>The mandatory deductible sum for private automobiles of 1500 cc engine capacity and above is currently 2,000 INR, whereas for private cars with 1499 cc or lower engine capacity is 1,000 INR. There is, however, a condition. If your automobile is old, your insurance provider may raise your compulsory deductible amount. This is owing to the notion that the amount of risk and likelihood of claims are raised according to the vehicle's age. As a result, when purchasing car insurance coverage, make sure you understand your compulsory deductible value.</li>\n</ul>\n</li>\n<li>Voluntary Deductibles: Not mandatory, but try if a Rs. 1000-2000 extra voluntary deductible is significantly reducing your premium. Take a call accordingly.\n<ul>\n<li>Think like this: Would you rather pay more upfront (and possibly make no claim), or incur some amount only when a claim is registered?</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"mcetoc_1jc3msljlat\">During a claim</h2>\n<ul>\n<li>Compulsary/mandatory deductible: The mandatory deductible sum for private automobiles of 1500 cc engine capacity and above is currently 2,000 INR, whereas for private cars with 1499 cc or lower engine capacity is 1,000 INR. There is, however, a condition. If your automobile is old, your insurance provider may raise your compulsory deductible amount. This is owing to the notion that the amount of risk and likelihood of claims are raised according to the vehicle's age. As a result, when purchasing car insurance coverage, make sure you understand your compulsory deductible value.</li>\n</ul>\n<h2 id=\"mcetoc_1jc3msljlau\">After a claim</h2>\n<ul>\n<li>If you have NCB protect/protection addon, make sure that the next renewal premium is calculated using this, after a claim.</li>\n<li>Verify policy, IDV, addons very carefully after a claim. Compare it with previous year's policy to make sure that coverage and premium is same-ish.</li>\n</ul>\n<h2 id=\"mcetoc_1jc3msljlar\">Extended warranty</h2>\n<ul>\n<li>I bought it for my car from Renault.</li>\n<li>For electric cars? must buy?</li>\n</ul>\n<h2 id=\"mcetoc_1jc3msljlav\">Other addons/covers that I have NOT tried myself but might be useful</h2>\n<ul>\n<li>Roadside assistance\n<ul>\n<li>esp for electric cars?</li>\n</ul>\n</li>\n<li>\n<p class=\"p1\">Non-Electrical Accessories/Electrical Accessories (IMT-24)</p>\n<ul>\n<li>\n<p class=\"p1\">IMT (Internal Motor Tariff) 24 in commercial vehicle insurance is offered by insurers to provide coverage<br>for damages caused to electrical and electronic fittings that are not a part of the manufacturer's initial<br>selling price. Some insurers may offer the electrical accessories add-on cover under the IMT 24. The</p>\n</li>\n<li>Especially if you have a expensive 3channel, 4K dashcam or expensive sound system</li>\n</ul>\n</li>\n<li>Engine Protection Cover: esp If you live in flood prone area:\n<ul>\n<li>Covers oil leakage and water damage</li>\n<li>Engine Protection covers damage causes by external sources like hydrostatic lock damage due to flooding and inundation, which is usually an exclusion under normal comprehensive insurance cover as well as (extended) warranty.</li>\n</ul>\n</li>\n<li> </li>\n</ul>",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
            ],
            "date_published": "2025-12-10T14:10:47+05:30",
            "date_modified": "2025-12-18T19:53:04+05:30"
        },
        {
            "id": "https://amberja.in/new-website-basic-setup-checklist.html",
            "url": "https://amberja.in/new-website-basic-setup-checklist.html",
            "title": "Small Business Website Basics: What to Add Before Telling Anyone Your URL",
            "summary": "<p>After managing multiple static websites across different platforms - from WordPress to my current favorite, Publii - I've learned that certain fundamental elements are non-negotiable regardless of which content management system (CMS) you choose. This checklist ensures your website is discoverable, measurable, and user-friendly from day one.</p>\n",
            "content_html": "<p>After managing multiple static websites across different platforms - from WordPress to my current favorite, Publii - I've learned that certain fundamental elements are non-negotiable regardless of which content management system (CMS) you choose. This checklist ensures your website is discoverable, measurable, and user-friendly from day one.</p>\n\n<p>Whether you're launching your first blog or your tenth business site, skipping these basics means missing opportunities for organic search visibility, tracking traffic growth and engagement, and professional credibility. I've made the mistake of launching sites without proper analytics or search console setup, only to realize months later that I had no data on how visitors were finding (or not finding) my content.</p>\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jb7bubmc2c\">The Checklist</a>\n<ul>\n<li><a href=\"#mcetoc_1jb7bto7p1v\">Connect to Google Search Console</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p20\">Submit Your Sitemap on Google Search Console</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p21\">Set Up Google Analytics</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p22\">Add WhatsApp Chat Button (When Appropriate)</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p23\">Protected Contact Email</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p24\">Copyright Notice</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p25\">Social Follow Buttons</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p26\">Social Share Buttons on Content</a></li>\n<li><a href=\"#mcetoc_1jb7bto7p27\">RSS or JSON Feed Link</a></li>\n<li><a href=\"#mcetoc_1jb7elbogb4\">Microsoft Clarity</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jb7dgd2r6a\">Other things you can consider adding to your website</a>\n<ul>\n<li><a href=\"#mcetoc_1jb7ebrppb1\">Relatively easier to setup</a></li>\n<li><a href=\"#mcetoc_1jb7ebrppb2\">Advanced, takes more time, skills and effort to setup</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1jb7bto7p2a\">Final Thoughts</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1jb7bubmc2c\">The Checklist</h2>\n<p>Once you have covered the basic (bought a domain, deploy first page on the domain), you can follow this checklist. This is my <em>website setup ritual</em> for every new website that I deploy:</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p1v\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Connect to Google Search Console</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Google Search Console is your direct line of communication with Google about how your site appears in search results.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Steps:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Visit <a class=\"underline\" href=\"https://search.google.com/search-console\">Google Search Console</a></li>\n<li class=\"whitespace-normal break-words\">Click \"Add Property\" and enter your website URL</li>\n<li class=\"whitespace-normal break-words\">Verify ownership using one of the available methods (HTML file upload, DNS record, or meta tag)</li>\n<li class=\"whitespace-normal break-words\">Once verified, you'll start receiving data about search impressions, clicks, and indexing issues</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Why it matters:</strong> Without Search Console, you're flying blind. You won't know which keywords drive traffic, which pages have indexing problems, or when Google encounters errors crawling your site.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p20\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Submit Your Sitemap on Google Search Console</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Your sitemap tells search engines which pages exist on your site and how they're organized.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Steps:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Locate your sitemap URL (typically <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">yoursite.com/sitemap.xml</code>)</li>\n<li class=\"whitespace-normal break-words\">In Google Search Console, navigate to \"Sitemaps\" in the left sidebar</li>\n<li class=\"whitespace-normal break-words\">Enter your sitemap URL and click \"Submit\"</li>\n<li class=\"whitespace-normal break-words\">Monitor the status to ensure Google successfully processes it</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Pro tip:</strong> Most platforms including Publii generate sitemaps automatically. Verify yours exists before submitting.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p21\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Set Up Google Analytics</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Understanding your audience's behavior is essential for making informed content and design decisions.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Steps:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Create a Google Analytics account at <a class=\"underline\" href=\"https://analytics.google.com\">analytics.google.com</a></li>\n<li class=\"whitespace-normal break-words\">Set up a new account (and a property under this account) for your website</li>\n<li class=\"whitespace-normal break-words\">Copy the tracking code and add it to your site's header. Test connection.</li>\n<li class=\"whitespace-normal break-words\">Open your website in a tab. Now verify that data is being collected by checking real-time reports.</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>What to track if you are new to Google Analytics:</strong> Pay attention to traffic sources, popular pages, bounce rates, and user demographics.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p22\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Add WhatsApp Chat Button (When Appropriate)</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">For businesses, service providers, or anyone wanting direct customer communication, a WhatsApp button can dramatically improve conversion rates.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>When to include it:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">E-commerce or service-based websites</li>\n<li class=\"whitespace-normal break-words\">Consulting or coaching sites</li>\n<li class=\"whitespace-normal break-words\">Local businesses</li>\n<li class=\"whitespace-normal break-words\">Any site where immediate customer support adds value</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Implementation:</strong> Use a simple HTML link like <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">https://wa.me/yourphonenumber</code> or integrate a floating button widget for better visibility.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p23\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Protected Contact Email</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Spam bots harvest email addresses from websites constantly. Protect your inbox while remaining accessible.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Steps:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Visit <a class=\"underline\" href=\"https://mailhide.io/\">mailhide.io</a></li>\n<li class=\"whitespace-normal break-words\">Enter your email address</li>\n<li class=\"whitespace-normal break-words\">Generate a protected link that requires CAPTCHA verification</li>\n<li class=\"whitespace-normal break-words\">Add this link to your contact page</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Alternative approach:</strong> A contact form.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p24\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Copyright Notice</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">A simple copyright statement establishes ownership and looks professional.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Template:</strong> <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">Copyright © 2025-26 Amber Jain</code></p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Where to place it:</strong> Typically in the footer of every page, automatically applied through your theme or template.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Note:</strong> Update the year annually, or use dynamic code to display the current year automatically.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p25\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Social Follow Buttons</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Make it easy for visitors to connect with you on the platforms where you're most active.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Recommended platforms in 2025-26:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Instagram (visual content, behind-the-scenes)</li>\n<li class=\"whitespace-normal break-words\">LinkedIn (professional content, B2B connections)</li>\n<li class=\"whitespace-normal break-words\">X/Twitter (quick updates, industry conversations)</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Best practices:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Place buttons in your footer or header for site-wide visibility.</li>\n<li class=\"whitespace-normal break-words\">Use recognizable icons.</li>\n</ul>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p26\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">Social Share Buttons on Content</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Enable readers to amplify your blogposts/content with minimal friction.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Recommended platforms for sharing in 2025:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Facebook (broad reach)</li>\n<li class=\"whitespace-normal break-words\">X/Twitter (quick sharing)</li>\n<li class=\"whitespace-normal break-words\">LinkedIn (professional content)</li>\n<li class=\"whitespace-normal break-words\">WhatsApp (personal recommendations)</li>\n<li>Copy button (a button that copies the content to be shared to clipboard)</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Where to add them:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Top or bottom of blog posts and/or pages</li>\n<li class=\"whitespace-normal break-words\">Or, floating sidebar for easy access while reading</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Technical note:</strong></p>\n<ul>\n<li>Choose between simple link-based sharing (lightweight). Check out these URL patterns, see how the content/URL (of another blogpost of mine) is embedded in these URLs so that sharing is just 2 clicks away:\n<ul>\n<li><code>https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Famberja.in%2Flinkedin-growth.html</code></li>\n<li><a href=\"https://twitter.com/intent/tweet?url=https%3A%2F%2Famberja.in%2Flinkedin-growth.html&amp;via=amberja_in&amp;text=Growing%20your%20organic%20reach%20on%20LinkedIn\">https://twitter.com/intent/tweet?url=https%3A%2F%2Famberja.in%2Flinkedin-growth.html&amp;via=amberja_in&amp;text=Growing%20your%20organic%20reach%20on%20LinkedIn</a></li>\n<li><a href=\"https://www.linkedin.com/sharing/share-offsite/?url=https%3A%2F%2Famberja.in%2Flinkedin-growth.html\">https://www.linkedin.com/sharing/share-offsite/?url=https%3A%2F%2Famberja.in%2Flinkedin-growth.html</a></li>\n<li><a href=\"https://api.whatsapp.com/send?text=Growing%20your%20organic%20reach%20on%20LinkedIn%20https%3A%2F%2Famberja.in%2Flinkedin-growth.html\">https://api.whatsapp.com/send?text=Growing%20your%20organic%20reach%20on%20LinkedIn%20https%3A%2F%2Famberja.in%2Flinkedin-growth.html</a></li>\n</ul>\n</li>\n<li>Or plugin-based solutions like <a href=\"https://sharethis.co\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-size: inherit;\">ShareThis</a><span style=\"font-size: inherit;\"> (more features but </span><em style=\"font-size: inherit;\">potentially</em><span style=\"font-size: inherit;\"> slower load times). </span></li>\n</ul>\n<hr>\n<h3 id=\"mcetoc_1jb7bto7p27\" class=\"font-claude-response-subheading text-text-100 mt-1 -mb-1.5\">RSS or JSON Feed Link</h3>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Despite social media dominance, RSS feeds remain valuable for dedicated readers and content aggregators, especially if you have a comprehensive content strategy (or you publish blogposts regularly).</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Steps:</strong></p>\n<ul class=\"[&amp;:not(:last-child)_ul]:pb-1 [&amp;:not(:last-child)_ol]:pb-1 list-disc space-y-2.5 pl-7\">\n<li class=\"whitespace-normal break-words\">Confirm your feed exists (usually something like <code>https://amberja.in/feed.json</code> or <code>https://amberja.in/feed.xml</code> or <code class=\"bg-text-200/5 border border-0.5 border-border-300 text-danger-000 whitespace-pre-wrap rounded-[0.4rem] px-1 py-px text-[0.9rem]\">yoursite.com/rss</code>)</li>\n<li class=\"whitespace-normal break-words\">Add a visible RSS icon linking to your header, sidebar or footer (so that it is visible on all pages of your website).</li>\n</ul>\n<p class=\"font-claude-response-body whitespace-normal break-words\"><strong>Why it still matters:</strong> RSS gives readers an option to be automatically notified whenever you publish new content, builds a loyal audience independent of algorithm changes, and enables content syndication.</p>\n<hr>\n<h3 id=\"mcetoc_1jb7elbogb4\">Microsoft Clarity</h3>\n<p><em><a href=\"https://clarity.microsoft.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Clarity</a></em> is a free user behavior analytics tool from Microsoft that helps you understand how users are interacting with your website through session recordings and heatmaps.</p>\n<hr>\n<h2 id=\"mcetoc_1jb7dgd2r6a\">Other things you can consider adding to your website</h2>\n<h3 id=\"mcetoc_1jb7ebrppb1\">Relatively easier to setup</h3>\n<ul>\n<li>Add a <strong>SSL certificate</strong>. See also: <a href=\"https://amberja.in/free-ssl-certificate-and-free-domain-name.html\" target=\"_blank\" rel=\"noopener noreferrer\">Free SSL Certificate &amp; Free Domain Name</a></li>\n<li><strong>Search</strong> box</li>\n<li class=\"whitespace-normal break-words\"><strong>Privacy Policy </strong>page - Legal requirement if collecting any user data</li>\n<li class=\"whitespace-normal break-words\"><strong>Cookie consent </strong>banner - Required by GDPR/CCPA if using analytics or tracking</li>\n<li class=\"whitespace-normal break-words\"><strong>Terms of Service (ToS) </strong>page - Protects you legally</li>\n<li class=\"whitespace-normal break-words\"><strong>Disclaimer </strong>page - Especially important for advice/informational sites</li>\n<li class=\"whitespace-normal break-words\"><strong>Security </strong>badges - If running e-commerce or collecting payments (SSL seals, payment processor logos)</li>\n<li class=\"whitespace-normal break-words\"><strong>Favicon</strong> - The small icon in browser tabs (looks professional)</li>\n<li class=\"whitespace-normal break-words\"><strong>Custom 404 error page</strong> - Better user experience when links break</li>\n<li class=\"whitespace-normal break-words\"><strong>Robots.txt file</strong> - Controls what search engines can crawl</li>\n<li>Branding and credibility\n<ul>\n<li class=\"whitespace-normal break-words\"><strong>Logo</strong> - Professional branding element</li>\n<li class=\"whitespace-normal break-words\"><strong>Testimonials </strong>section - Social proof for businesses (e.g. Link to Google Business profile or an award or certification etc.)</li>\n<li><strong>Media mentions </strong>page - If you've been featured elsewhere</li>\n<li class=\"whitespace-normal break-words\"><strong>Team/Staff </strong>page - For organizations</li>\n</ul>\n</li>\n<li> </li>\n</ul>\n<h3 id=\"mcetoc_1jb7ebrppb2\">Advanced, takes more time, skills and effort to setup</h3>\n<ul>\n<li class=\"whitespace-normal break-words\"><strong>Site speed </strong>optimization - Image compression, caching, minification (see also: <a href=\"https://pagespeed.web.dev/analysis?url=https%3A%2F%2Famberja.in%2F\" target=\"_blank\" rel=\"noopener noreferrer\">Google PageSpeed Insights</a>)</li>\n<li class=\"whitespace-normal break-words\"><strong>Mobile responsiveness </strong>check - Test on actual devices</li>\n<li class=\"whitespace-normal break-words\"><strong>Lazy loading for images</strong> - Improves page load times</li>\n<li class=\"whitespace-normal break-words\"><strong>CDN </strong>setup - For faster global content delivery (especially if you serve downloadable static assets like videos, PDFs etc.)</li>\n<li class=\"whitespace-normal break-words\"><strong>Backups </strong>system - Automated regular backups that are as easy to restore as possible</li>\n<li class=\"whitespace-normal break-words\"><strong>Related posts </strong>widget - Keeps visitors engaged longer, reduces bounce rate</li>\n<li><strong>Comments section</strong> - If you want community engagement.</li>\n</ul>\n<hr>\n<h2 id=\"mcetoc_1jb7bto7p2a\" class=\"font-claude-response-heading text-text-100 mt-1 -mb-0.5\">Final Thoughts</h2>\n<p class=\"font-claude-response-body whitespace-normal break-words\">This checklist has saved me countless hours. Every time I launch a new site, I run through these items methodically. The few hours you invest in proper setup pays dividends in discoverability, tracking user growth and engagement, as well as user experience.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">What's missing from your current websites? Pick one item from this list and implement it today - your future self will thank you.</p>",
            "image": "https://amberja.in/media/posts/56/website-launch.webp",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Tech &amp; Programming",
                   "Growth / Marketing",
                   "Blogposts"
            ],
            "date_published": "2025-11-29T14:08:58+05:30",
            "date_modified": "2025-11-29T15:01:51+05:30"
        },
        {
            "id": "https://amberja.in/use-openrouterai-inside-different-apps.html",
            "url": "https://amberja.in/use-openrouterai-inside-different-apps.html",
            "title": "Use Openrouter.ai inside different AI clients",
            "summary": "Tried and Tested personally. It works! Use Openrouter inside Cursor: Tried personally&hellip;",
            "content_html": "<h2>Tried and Tested personally. It works!</h2>\n<ul>\n<li><a href=\"https://openrouter.ai/announcements/use-openrouter-models-in-cursor-try-it-with-moonshot-ais-kimi-k2\" target=\"_blank\" rel=\"noopener noreferrer\">Use Openrouter inside Cursor</a>: Tried personally and it works.</li>\n<li><a href=\"https://code.visualstudio.com/docs/copilot/customization/language-models#_add-a-model-from-a-built-in-provider\" target=\"_blank\" rel=\"noopener noreferrer\">Use Openrouter inside VS Code</a>: Tried personally and it works.</li>\n</ul>\n<h2>Seems feasible but haven't tried it yet</h2>\n<ul>\n<li>Use Openrouter inside Claude Code: Haven't tried personally - <a href=\"https://ishan.rs/posts/claude-code-with-openrouter\" target=\"_blank\" rel=\"noopener noreferrer\">Link 1</a></li>\n</ul>",
            "image": "https://amberja.in/media/posts/52/openrouter-logo.svg",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Linkmarks",
                   "AI / LLMs"
            ],
            "date_published": "2025-11-25T02:33:41+05:30",
            "date_modified": "2025-11-25T17:17:40+05:30"
        },
        {
            "id": "https://amberja.in/basic-pipenv-workflow.html",
            "url": "https://amberja.in/basic-pipenv-workflow.html",
            "title": "Basic Pipenv workflow",
            "summary": "Basic pipenv commands for quick recall: To enter virtual env made by&hellip;",
            "content_html": "<p>Basic pipenv commands for quick recall:</p><h2 id=\"pipenv-commands-needed-on-a-daily-basis\">Pipenv commands needed on a daily basis</h2>\n<ul>\n<li><p>To enter virtual env made by pipenv, use: <code>pipenv shell</code>.</p></li>\n<li><p>To exit virtual env, use <code>exit</code> command. Don’t use <code>deactivate</code>.</p></li>\n<li><p>Use <code>pipenv</code> instead of <code>pip</code> to install/uninstall packages:</p><ul>\n<li>You can install a package as project dependency for deployment/execution (under packages section of Pipfile using): <code>pipenv install flask</code></li>\n<li>You can install a package as project dependency for development (under dev-packages section of Pipfile using): <code>pipenv install --dev pytest</code></li>\n<li>To uninstall run this command (which also removes references to python package both from Pipfile and Pipfile.lock): <code>pipenv uninstall django</code></li>\n</ul>\n</li>\n<li><p>The Pipfile.lock is intended to specify, based on the packages present in Pipfile, which specific version of those should be used, avoiding the risks of automatically upgrading packages that depend upon each other and breaking your project dependency tree. This command will lookup your virtual environment folder to generate the Pipfile.lock file for you automatically, based on the currently installed versions: <code>pipenv lock</code> </p></li>\n<li><p>Delete a virtual env created by pipenv: <code>pipenv --rm</code></p></li>\n<li><p>To see location of virtual env added by pipenv: <code>pipenv --venv</code></p></li>\n</ul>\n<h2 id=\"install-pipenv-on-mac\">Install Pipenv on Mac</h2>\n<p><code>brew install pipenv</code></p><h2 id=\"migrate-requirementstxt-to-pipenv\">Migrate requirements.txt to Pipenv</h2>\n<ol>\n<li><p>Navigate to your project directory and initialize a Pipfile: <code>pipenv install</code></p><ul>\n<li>This should automatically find requirements.txt file in pwd and convert it into Pipfile. In case it doesn’t, you can run: <code>pipenv install -r requirements.txt</code></li>\n</ul>\n</li>\n<li><p>If certain dependencies are only required during development (e.g., pytest or black), you can reinstall them under dev-packages section of Pipenv using: <code>pipenv install &lt;package_name&gt; --dev</code></p></li>\n<li><p>Once everything is working fine, you can safely move the old requirements.txt file outside the folder, but still keep it as a backup somewhere.</p></li>\n</ol>\n<h2 id=\"setup-existing-project-with-existing-pipenv-on-new-laptop-with-fresh-virtualenv\">Setup existing project with existing Pipenv on new laptop with fresh virtualenv</h2>\n<ul>\n<li>Install pipenv, then <code>cd</code> to the project directory which contains Pipenv file.</li>\n<li>This command will create a new virtual environment as well as install dependencies listed in Pipfile.lock: <code>pipenv install</code></li>\n</ul>\n",
            "image": "https://amberja.in/media/posts/51/pipenv.webp",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Tech &amp; Programming",
                   "Blogposts"
            ],
            "date_published": "2025-11-24T15:41:55+05:30",
            "date_modified": "2025-11-24T16:38:18+05:30"
        },
        {
            "id": "https://amberja.in/managing-a-library-of-prompts-with-variables-using-cloud-storage-espanso-forms-and-symlinks.html",
            "url": "https://amberja.in/managing-a-library-of-prompts-with-variables-using-cloud-storage-espanso-forms-and-symlinks.html",
            "title": "Managing a Library of prompts with variables - using Cloud Storage, Espanso Forms and Symlinks",
            "summary": "Install and sync Espanso config on a new Mac Download and install&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1jac9ksm82\">Install and sync Espanso config on a new Mac</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1jac9ksm82\">Install and sync Espanso config on a new Mac</h2>\n<ol>\n<li>Download and install Espanso: <a href=\"https://espanso.org/install/\">https://espanso.org/install/</a></li>\n<li>Type <code>:espanso</code> in a text field of any app to make sure that espanso is running.</li>\n<li>Sync your espanso folder from cloud storage to locally on your Mac.\n<ul>\n<li>In my case, the location is (this location is written in a way that it's only supposed to make sense to me): <code>Dropbox_mejain1989@gmail/espanso/</code></li>\n</ul>\n</li>\n<li>Run this command in Terminal: <code>espanso path config</code>. <br>Keep the path handy except the last <code>/espanso/</code> part at the end. For e.g.\n<ul>\n<li>If command printed <code>/Users/nancy/Library/Application Support/espanso</code>, then just remember <code>/Users/nancy/Library/Application Support/</code>.</li>\n</ul>\n</li>\n<li>Stop espanso running in background: <code>espanso stop</code></li>\n<li>Delete default <code>espanso/</code> folder created during installation (which is located at <code>/Users/nancy/Library/Application Support/</code> as printed in Step-4).</li>\n<li>Now create a symbolic link at Espanso's default location pointing to folder kept in Cloud Storage.\n<ul>\n<li>In my case the command looks like this: <code>ln -s \"/Users/nancy/Insync/me.jain1989@gmail.com/Dropbox/espanso/\" \"/Users/nancy/Library/Application Support</code><br><code>/\"</code></li>\n</ul>\n</li>\n<li>Now restart espanso and try a shortcut stored in your espanso on Dropbox.\n<ul>\n<li>In my case, I try this with <code>:dropbox</code> which only works if above setup if working correctly.</li>\n</ul>\n</li>\n</ol>\n<h1>Espanso Forms</h1>\n<p>Using Espanso Forms feature to take dynamic input for variables inserted in prompts.</p>\n<p>To be done.</p>\n<p> </p>",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
            ],
            "date_published": "2025-11-19T01:37:36+05:30",
            "date_modified": "2025-11-20T12:30:36+05:30"
        },
        {
            "id": "https://amberja.in/the-great-token-efficiency-debate-minified-json-yaml-toon-or-csv.html",
            "url": "https://amberja.in/the-great-token-efficiency-debate-minified-json-yaml-toon-or-csv.html",
            "title": "The Great Token Efficiency Debate: Minified JSON, YAML, TOON or CSV?",
            "summary": "TOON format for less token usage My colleagues Ajay Joshi &amp; Deepak Shah were&hellip;",
            "content_html": "<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1j9p91js92e\">Introduction</a></li>\n<li><a href=\"#mcetoc_1j9p91js92f\">Alternative approach #1</a></li>\n<li><a href=\"#mcetoc_1j9p91js92g\">Alternative approach #2</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1j9p91js92e\">TOON format for less token usage</h2>\n<p>My colleagues <span class=\"\" role=\"presentation\">Ajay Joshi</span> &amp; <span class=\"\" role=\"presentation\">Deepak Shah</span> were discussing <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://jsontoon.com/\" data-sk=\"tooltip_parent\" href=\"https://jsontoon.com/\" rel=\"noopener noreferrer\">https://jsontoon.com/</a> which converts JSON to TOON format which is supposedly a more compact format with less token usage on LLMs.</p>\n<blockquote>\n<p>TOON: Token-Oriented Object Notation is a compact, human-readable serialization format designed for passing structured data to Large Language Models with significantly reduced token usage. It's intended for <i data-stringify-type=\"italic\">LLM input</i> as a lossless, drop-in representation of JSON data. Website: <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://github.com/toon-format/toon\" data-sk=\"tooltip_parent\" href=\"https://github.com/toon-format/toon\" rel=\"noopener noreferrer\">https://github.com/toon-format/toon</a></p>\n</blockquote>\n<div> </div>\n<div class=\"p-rich_text_section\">The example on <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://jsontoon.com/\" data-sk=\"tooltip_parent\" href=\"https://jsontoon.com/\" rel=\"noopener noreferrer\">https://jsontoon.com/</a> website compares TOON to \"pretty json\" (but not to minified json):</div>\n<div> </div>\n<div><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://amberja.in/media/posts/46/SCR-20251111-mgrr-2.png\" alt=\"JSON to TOON\" width=\"1020\" height=\"956\" sizes=\"(min-width: 760px) 660px, calc(93.18vw - 30px)\" srcset=\"https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-2-xs.png 320w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-2-sm.png 480w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-2-md.png 768w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-2-xl.png 1024w\"></figure></div>\n<div> </div>\n<div> </div>\n<div>But I was curious to compare: if toon format is consistently using lesser tokens than \"minified json\". So I searched reddit:</div>\n<h2 id=\"mcetoc_1j9p91js92f\">Alternative approach #1</h2>\n<div> </div>\n<div>First I found another idea that <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://www.reddit.com/r/PromptEngineering/comments/1m7bs7y/been_using_this_trick_to_compress_jsons_and_save/\" data-sk=\"tooltip_parent\" href=\"https://www.reddit.com/r/PromptEngineering/comments/1m7bs7y/been_using_this_trick_to_compress_jsons_and_save/\" rel=\"noopener noreferrer\">someone has shared</a>:</div>\n<div>Here the OP is compressing json</div>\n<blockquote>\n<div><code class=\"c-mrkdwn__code\" data-stringify-type=\"code\">{ \"main_character\": { \"name\": \"Miles Piper\", \"traits\": \"middle-aged, wiry, musician\" }, \"setting\": { \"city\": \"Nooga\", \"season\": \"Spring\" } }</code></div>\n</blockquote>\n<div> </div>\n<div>to</div>\n<blockquote>\n<div><code class=\"c-mrkdwn__code\" data-stringify-type=\"code\">{\"mc\":{\"n\":\"MilesPiper\",\"t\":\"mid-aged,wiry,musician\"},\"set\":{\"c\":\"Nooga\",\"s\":\"Spring\"}}</code></div>\n</blockquote>\n<div> </div>\n<div>Disclaimer for this approach: Make sure your original JSONs have enough self‑contained context. When you shorten keys, like if main_character = mc, you’re removing semantic hints [for LLM model]. To keep things clear for the LLM, your original JSON should include enough surrounding info or a parent scope so it’s obvious what domain you’re in.</div>\n<div> </div>\n<div>I think that we can solve this with a <code>Taxanomy.md</code> added in system prompt which simply has key value pairs e.g. <code class=\"c-mrkdwn__code\" data-stringify-type=\"code\">mc:main_character;n=name;t=traits....</code><br>\n<h2 id=\"mcetoc_1j9p91js92g\">Alternative approach #2</h2>\n<p> </p>\n<div class=\"p-rich_text_section\">Next, TOON's github readme then pointed me to this website: <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://www.curiouslychase.com/playground/format-tokenization-exploration\" data-sk=\"tooltip_parent\" href=\"https://www.curiouslychase.com/playground/format-tokenization-exploration\" rel=\"noopener noreferrer\">Format Tokenization Playground</a><br aria-hidden=\"true\"><br aria-hidden=\"true\"></div>\n<div><figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://amberja.in/media/posts/46/SCR-20251111-mgrr-3.png\" alt=\"Tokenization Playground for different formats (JSON, TOON, CSV etc)\" width=\"1447\" height=\"944\" sizes=\"(min-width: 760px) 660px, calc(93.18vw - 30px)\" srcset=\"https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-3-xs.png 320w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-3-sm.png 480w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-3-md.png 768w ,https://amberja.in/media/posts/46/responsive/SCR-20251111-mgrr-3-xl.png 1024w\"></figure></div>\n<br>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet p-rich_text_list--nested\" data-stringify-type=\"unordered-list\" data-list-tree=\"true\" data-indent=\"0\" data-border=\"0\">\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">When a CSV lossless representation of data exists, CSV is always most token efficient</li>\n<li data-stringify-indent=\"0\" data-stringify-border=\"0\">If a CSV lossless representation doesn't exists, minified json is always most token efficient.</li>\n</ul>\n<div> </div>\n<div class=\"p-rich_text_section\">So with a cursory read / limited understanding of this table seems to suggest that CSV/minifiedJSON seems better, but then TOON's readme has benchmarks section (that looks at both token usage as well as accuracy) and paints a different story: <a target=\"_blank\" class=\"c-link\" data-stringify-link=\"https://github.com/toon-format/toon?tab=readme-ov-file#benchmarks\" data-sk=\"tooltip_parent\" href=\"https://github.com/toon-format/toon?tab=readme-ov-file#benchmarks\" rel=\"noopener noreferrer\">https://github.com/toon-format/toon?tab=readme-ov-file#benchmarks</a></div>\n<div> </div>\n<div><hr></div>\n<div> </div>\n<div>This isn't the end of it. I intend to dive deeper into this, but got a busy week ahead. I will update this post if and when I get time to explore more about this topic.</div>\n<div> </div>\n<div><em>Until next time...</em></div>\n</div>",
            "image": "https://amberja.in/media/posts/46/toon-yaml-json-csv.png",
            "author": {
                "name": "Written by Amber Jain"
            },
            "tags": [
                   "Blogposts",
                   "AI / LLMs"
            ],
            "date_published": "2025-11-11T16:30:08+05:30",
            "date_modified": "2025-11-11T17:06:14+05:30"
        }
    ]
}
